cases/artigo_mestrado/old/pipe-fluid/fluid/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

// Velocity inlet 0.5 m/s. Flow passes through the Darcy porous zone (block B).

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            noSlip;
    }

    bottom
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
