cases/artigo_mestrado/old/pipe-fluid/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3919;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3939;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          101;
        startFace       3959;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          101;
        startFace       4060;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4040;
        startFace       4161;
    }
)

// ************************************************************************* //
